{"pageProps":{"post":{"title":"Google cost cutting 💰 , lessons from being laid off 👨‍💻, moats in the AI economy 🏰","date":"2022-12-29T05:35:07.322Z","slug":"tech-2023-12-29","content":"<blockquote>\n<p>TECH 2022-12-29</p>\n</blockquote>\n<h1>Google cost cutting 💰 , lessons from being laid off 👨‍💻, moats in the AI economy 🏰</h1>\n<h3><a href=\"https://www.composer.trade/?utm_source=tldr&#x26;utm_medium=newsletter&#x26;utm_campaign=12-29-22&#x26;utm_content=homepage\">Protecting your money during a downturn takes more than a robo-advisor and a prayer (Sponsor)</a></h3>\n<p>As many have recently learned the hard way, the chart doesn’t only go up – it can also go down. Picking stocks is difficult. And after a decade+ bull run, the market is changing. Is your portfolio?</p>\n<p><a href=\"https://www.composer.trade/?utm_source=tldr&#x26;utm_medium=newsletter&#x26;utm_campaign=12-29-22&#x26;utm_content=homepage\">Composer</a> offers an array of professionally-created investment strategies that trade based on logic and data. Take advantage of advanced algorithmic trading — no PhD required, just point and click.</p>\n<p>With Composer, <a href=\"https://www.composer.trade/?utm_source=tldr&#x26;utm_medium=newsletter&#x26;utm_campaign=12-29-22&#x26;utm_content=homepage\">your portfolio reacts to the market</a>, rather than emotions and sensationalized tweets. It can move your portfolio into its best performers when the market is doing well, and hedge risk during volatility.</p>\n<p><a href=\"https://www.composer.trade/?utm_source=tldr&#x26;utm_medium=newsletter&#x26;utm_campaign=12-29-22&#x26;utm_content=homepage\">Create a free account in 90 seconds</a></p>\n<h2>📱 Big Tech &#x26; Startups</h2>\n<h3><a href=\"https://www.macrumors.com/2022/12/28/apple-reevaluate-iphone-15-lineup/?utm_source=tldrnewsletter\">Apple Reportedly 'Seriously' Concerned About iPhone 14 Plus Sales, Looking to Reevaluate iPhone 15 Lineup (2 minute read)</a></h3>\n<p>Apple is reportedly seriously concerned over the performance of the iPhone 14 Plus. The company is considering changing its iPhone lineup next year. It may further differentiate the Pro and non-Pro models or reduce the price of the Plus model. This may mean the standard iPhone may also see a price decrease. Dynamic Island will likely be implemented in all iPhone 15 models.</p>\n<h3><a href=\"https://archive.ph/5XZZW?utm_source=tldrnewsletter\">Google Employees Brace for a Cost-Cutting Drive as Anxiety Mounts (8 minute read)</a></h3>\n<p>Google employees are concerned over a new employee evaluation system that could be used to cull the workforce. In a letter to the company's vice president of human resources, workers noted that some managers have been aggressively pressured to apply a quota. Google employees are increasingly anxious over management decisions that could result in broader layoffs. The company has so far avoided large-scale job cuts, unlike other big tech companies.</p>\n<h2>🚀 Science &#x26; Futuristic Technology</h2>\n<h3><a href=\"https://spectrum.ieee.org/rhumatoid-arthritis?utm_source=tldrnewsletter\">A New Treatment for Arthritis: Vagus-Nerve Stimulation (4 minute read)</a></h3>\n<p>SetPoint Medical will report preliminary findings of a device that stimulates the vagus nerve to treat rheumatoid arthritis in late 2023. The Reset-RA implant is inserted beside a patient's vagus nerve, stimulating the nerve for a minute up to four times a day. It targets the inflammatory reflex, a neural network that indirectly regulates immune responses to infection and injury. Rat studies show that vagus stimulation can suppress the release of immune-signaling molecules.</p>\n<h3><a href=\"https://arstechnica.com/science/2022/12/these-scientists-figured-out-how-to-make-tasty-popcorn-with-infrared-cooking/?utm_source=tldrnewsletter\">Some day soon we might be making popcorn with infrared poppers (3 minute read)</a></h3>\n<p>Scientists from Iran have figured out how to make popcorn with infrared cooking. Popcorn pops when it is heated above 180 degrees Celsius due to trapped water within the kernel's endosperm. When it is heated, the pressure from the superheated steam ruptures the kernel, and the starch within is released in a foam. The Iranian team found that heating up kernels using 700 W IR power at a distance of 10 cm produced the highest yield and highest rated popcorn.</p>\n<h2>💻 Programming, Design &#x26; Data Science</h2>\n<h3><a href=\"https://danni763618.typeform.com/to/P4Bvu79U\">Get your open job postings featured in this newsletter for free! (Sponsor)</a></h3>\n<p>We are launching TLDR's free job board next week, if you are interested in hiring tech talent through TLDR please fill out <a href=\"https://danni763618.typeform.com/to/P4Bvu79U\">this short form</a> to get early access.</p>\n<p>The job board will allow you to hire for full time, part time, and contractor roles, I will be curating a few of the most interesting jobs to highlight in this newsletter, <a href=\"https://danni763618.typeform.com/to/P4Bvu79U\">fill out this form for early access!</a></p>\n<h3><a href=\"https://github.com/nikvdp/pbproxy?utm_source=tldrnewsletter\">pbproxy (GitHub Repo)</a></h3>\n<p>pbproxy is a tool for interacting with clipboards on remote machines. It mimics macOS's pbcopy and pbpaste commands. pbproxy enables pbcopy and pbpaste on any remote machine with ssh access. It works on both macOS and Linux machines.</p>\n<h3><a href=\"https://www.stevenbuccini.com/8-hard-truths-on-getting-laid-off?utm_source=tldrnewsletter\">8 Hard Truths I learned when I got laid off from my SWE job (12 minute read)</a></h3>\n<p>Getting laid off can be a profoundly lonely experience. It may take a while to find new employment and you may find you have to do things you don't want to do. It is important to keep perspective about your desirability, in the relationships around you, and with potential offers. Getting laid off can be a valuable educational experience and you may learn more from the experience than when you are employed.</p>\n<h2>🎁 Miscellaneous</h2>\n<h3><a href=\"https://arstechnica.com/tech-policy/2022/12/twitter-rival-mastodon-rejects-funding-to-preserve-nonprofit-status/?utm_source=tldrnewsletter\">Twitter rival Mastodon rejects funding to preserve nonprofit status (3 minute read)</a></h3>\n<p>Mastodon has rejected more than five investment offers from venture capital firms in recent months. Its founder and sole shareholder, Eugen Rochko, has pledged to protect Mastodon's non-profit status. The platform saw a surge in users from 300,000 to 2.5 million between October and November. Its independence and choice of moderation styles across its servers is part of its appeal. Mastodon relies on donations, out of which Rochko currently pays himself €2,900 per month.</p>\n<h3><a href=\"https://spectrum.ieee.org/satellite-cellphone?utm_source=tldrnewsletter\">Your Cellphone Will Be a Satphone (4 minute read)</a></h3>\n<p>Mobile manufacturers are starting to make phones capable of connecting to traditional satellite-communications networks. The capability currently only allows people to text for help in areas where there is no terrestrial coverage. Conventional calling and high-bandwidth data streaming aren't available yet. Many telecom providers worldwide are set to switch on support for satellite services in 2023.</p>\n<h2>⚡ Quick Links</h2>\n<h3><a href=\"https://arstechnica.com/gadgets/2022/12/ios-16-exploit-lets-you-set-the-system-font-to-comic-sans-and-other-things/?utm_source=tldrnewsletter\">iOS 16 exploit lets you set the system font to Comic Sans (2 minute read)</a></h3>\n<p>This article links to a tool that can temporarily swap the iOS system font with another for users still on iOS 16.1.2 or below.</p>\n<h3><a href=\"https://github.com/biox/pa?utm_source=tldrnewsletter\">pa (GitHub Repo)</a></h3>\n<p>pa is a simple password manager written in a portable posix shell.</p>\n<h3><a href=\"https://robotic.substack.com/p/ml-moats?utm_source=tldrnewsletter\">Predicting machine learning moats (7 minute read)</a></h3>\n<p>Potential machine learning moats include a state-of-the-art model, private data, network effects, branding, or user interfaces.</p>\n<h3><a href=\"https://uiverse.io/?ref=producthunt?utm_source=tldrnewsletter\">uiverse (Website)</a></h3>\n<p>uiverse is a customizable collection of 636 UI elements made with HTML and CSS free for personal and commercial use.</p>\n<h3><a href=\"https://www.cnbc.com/2022/12/28/metaverse-off-to-ominous-start-after-vr-headset-sales-shrank-in-2022.html?utm_source=tldrnewsletter\">Metaverse off to ominous start after VR headset sales shrank in 2022 (4 minute read)</a></h3>\n<p>Sales of VR headsets in the US declined 2% this year compared to last year.</p>\n<h3><a href=\"https://misfra.me/2022/sqlite-automatic-indexes/?utm_source=tldrnewsletter\">SQLite's automatic indexes (3 minute read)</a></h3>\n<p>SQLite sometimes creates automatic indexes that last only for the duration of a single SQL statement when no indexes are available to aid the evaluation of a query.</p>\n"}},"__N_SSG":true}