{"pageProps":{"post":{"title":"Google vs OpenAI 🤖, Tesla's next-gen platform 🚗, hiring virtual people 🧍","date":"2023-01-03T05:35:07.322Z","slug":"tech-2023-01-03","content":"<blockquote>\n<p>TLDR 2023-01-03</p>\n</blockquote>\n<h1>Google vs OpenAI 🤖, Tesla's next-gen platform 🚗, hiring virtual people 🧍</h1>\n<h3><a href=\"https://www.provartesting.com/lets-talk/\">If you’re developing for Salesforce, you need a Salesforce-native test automation solution (Sponsor)</a></h3>\n<p>Do you have a reliable automated testing solution for Salesforce? Many testing tools that claim to support Salesforce use outdated techniques, are overly complex, or aren’t compatible with major updates. Or maybe your organization just hasn't moved away from manual testing yet.</p>\n<p>Any of this sound familiar?</p>\n<p>Provar Automation is the solution — a <a href=\"https://www.provartesting.com/product-tour/?utm_source=tldr&#x26;utm_campaign=20230103\">purpose-built, premier test automation solution for Salesforce</a>:</p>\n<ul>\n<li>Low-code solution: it's simple and easy for your team to get started</li>\n<li>End-to-end: test your full business processes in Salesforce and beyond. Provar combines both UI and API testing to deliver total coverage</li>\n<li>Salesforce-first: stay current and aligned with the latest Salesforce updates</li>\n</ul>\n<p><a href=\"https://www.provartesting.com/lets-talk/\">Learn more about Provar Automation’s unique advantages and get a demo</a></p>\n<h2>📱 Big Tech &#x26; Startups</h2>\n<h3><a href=\"https://www.tesmanian.com/blogs/tesmanian-blog/tesla-will-present-the-generation-3-platform-at-investor-day-in-march-2023?utm_source=tldrnewsletter\">Tesla to Present the Generation 3 Platform at Investor Day in March 2023 (2 minute read)</a></h3>\n<p>Tesla's Generation 3 platform will be presented at Investor Day on March 1. The new platform promises to reduce the overall cost of production. It will also be able to produce more vehicles in a smaller area than the current platform. Tesla has been hinting at a new vehicle for months and there are hints it may be unveiled soon.</p>\n<h3><a href=\"https://www.forbes.com/sites/johanmoreno/2022/12/29/openai-positioned-itself-as-the-ai--leader-in-2022-but-could-google-supersede-it-in-23/?sh=606903205321?utm_source=tldrnewsletter\">OpenAI Positioned Itself As The AI Leader In 2022. But Could Google Supersede It In ‘23? (5 minute read)</a></h3>\n<p>OpenAI launched DALL-E 2 and ChatGPT this year, showing the general public the possibilities of AI. Opening beta access to its models to basically anyone allowed many to experience the capabilities of AI for the first time. OpenAI is projecting $1 billion in revenue by 2024. Google has been very slow to release its generative models, but it will likely rise to compete with OpenAI in 2023.</p>\n<h2>🚀 Science &#x26; Futuristic Technology</h2>\n<h3><a href=\"https://www.cnbc.com/2023/01/02/companies-can-hire-a-virtual-person-for-about-14k-a-year-in-china.html?utm_source=tldrnewsletter\">Companies can ‘hire’ a virtual person for about $14k a year in China (3 minute read)</a></h3>\n<p>Companies in China, including state tourism boards and state media, are hiring virtual people to generate content. Virtual people are digital humans that are created through a combination of animation, sound tech, and machine learning. It costs around $14,300 a year for a three-dimensional virtual person. Many brands are looking for spokespeople that are immune to negative press or other legal issues.</p>\n<h3><a href=\"https://interestingengineering.com/innovation/high-tech-protein-from-thin-air?utm_source=tldrnewsletter\">This startup makes high-tech protein from thin air by using solar energy (2 minute read)</a></h3>\n<p>Solar Foods is a company that makes food directly from carbon dioxide using microbes cultured with electricity and air. It plans to start production in 2023 with a factory that will be able to produce 100 tons per year. Solar Foods' process is able to grow food with near-zero greenhouse gas emissions using solar and wind power. The resulting powder it produces is enriched with protein and has a neutral, mild taste.</p>\n<h2>💻 Programming, Design &#x26; Data Science</h2>\n<h3><a href=\"https://mafs.dev/?utm_source=tldrnewsletter\">Mafs (Website)</a></h3>\n<p>Mafs is a package containing React components for interactive math. It allows users to build interactive and animated visuals with declarative code. Mafs can create visuals for Bézier curves, Riemann sums, fancy parabolas, projectile motion, and more.</p>\n<h3><a href=\"https://github.com/microsoft/pyright?utm_source=tldrnewsletter\">Pyright (GitHub Repo)</a></h3>\n<p>Pyright is a fast type checker for large Python source bases. It features a watch mode that performs fast incremental updates when files are modified. Pyright is both a command-line tool and a VS Code extension. The VS Code extension supports features such as intelligent type completion, automatic import statements, signature completion tips, and methods to find and rename references and symbols.</p>\n<h2>🎁 Miscellaneous</h2>\n<h3><a href=\"https://nymag.com/intelligencer/2022/12/remote-work-is-poised-to-devastate-americas-cities.html?utm_source=tldrnewsletter\">Remote Work Is Poised to Devastate America’s Cities (8 minute read)</a></h3>\n<p>Full-time remote work has grown less prevalent since the pandemic, but flexible work arrangements have proved stickier. Foot traffic in central business districts in virtually all major US cities is substantially lower than in 2019. Firms are cutting costs by ditching office space, leaving over 50% of offices unoccupied across the nation. The plummeting demand for commercial real-estate has resulted in less property taxes, a significant source of public funds. Businesses that serve CBD workers are losing customers and paying less sales tax.</p>\n<h3><a href=\"https://nostalgebraist.tumblr.com/post/705192637617127424/gpt-4-prediction-it-wont-be-very-useful?utm_source=tldrnewsletter\">gpt-4 prediction: it won’t be very useful (10 minute read)</a></h3>\n<p>OpenAI is set to release GPT-4 sometime in early 2023. Very little is known about the model so far. Research on the emergence of capabilities with scales in large language models suggests that while increased scale is usually helpful and almost never harmful, there aren't many reliable trends that can be used for forecasting. GPT-4 will likely be used for the same kind of work GPT-3 is used for. LLMs are new types of machines that people still haven't figured out how to use provably, reliably, and repeatedly for tasks.</p>\n<h2>⚡ Quick Links</h2>\n<h3><a href=\"https://github.com/bigscience-workshop/petals?utm_source=tldrnewsletter\">Petals (GitHub Repo)</a></h3>\n<p>Petals allows users to run large language models collaboratively using distributed computing.</p>\n<h3><a href=\"https://www.smithsonianmag.com/smart-news/this-new-shock-absorbing-gel-can-withstand-supersonic-impacts-180981319/?utm_source=tldrnewsletter\">This New Shock-Absorbing Gel Can Withstand Supersonic Impacts (3 minute read)</a></h3>\n<p>Researchers from England have developed a novel material from a protein found in human cells that can absorb the impact of projectiles flying faster than the speed of sound.</p>\n<h3><a href=\"https://www.bleepingcomputer.com/news/security/pytorch-discloses-malicious-dependency-chain-compromise-over-holidays/?utm_source=tldrnewsletter\">PyTorch discloses malicious dependency chain compromise over holidays (4 minute read)</a></h3>\n<p>A malicious counterfeit dependency used in a PyTorch-nightly build released over the holidays has led to a successful compromise.</p>\n<h3><a href=\"https://matt-rickard.com/a-new-ml-stack?utm_source=tldrnewsletter\">A New ML Stack (2 minute read)</a></h3>\n<p>Parts of the machine learning stack of the 2010s have become irrelevant, but some things like developer tools and libraries have stayed the same.</p>\n<h3><a href=\"https://www.tbray.org/ongoing/When/202x/2022/12/30/Mastodon-Privacy-and-Search?utm_source=tldrnewsletter\">Private and Public Mastodon (10 minute read)</a></h3>\n<p>This article discusses the issues with implementing search capabilities in Mastodon, a platform that values privacy.</p>\n<h3><a href=\"https://brickexperimentchannel.wordpress.com/2022/11/19/my-youtube-earnings/?utm_source=tldrnewsletter\">My Youtube earnings (3 minute read)</a></h3>\n<p>The Brick Experiment channel, a Lego YouTube channel, has earned a total of $664,000 USD since its launch in December 2017.</p>\n"}},"__N_SSG":true}